[["Combine all ingredients in blender. Pureé until very smooth. Pour into glasses."], ["Cut peel and white pith from grapefruits and oranges. Cut between membranes to release segments. Combine fruit in large shallow bowl. (Fruit can be segmented 1 day ahead. Cover and refrigerate.)", "Place mint and sugar in processor. Using on/off turns, blend until mint is finely chopped, occasionally scraping down sides of bowl. Sprinkle mint sugar and pomegranate seeds over fruit; serve."], ["Bring water, sugar, and ginger to a boil in a 2-quart saucepan, then stir until sugar is dissolved. Simmer 10 minutes, stirring occasionally, then remove from heat and let steep 15 minutes. Pour ginger syrup through a sieve into a bowl, discarding ginger. Chill, covered, at least 2 hours.", "Toss fruit and mint with 1/4 cup syrup, or to taste."], ["Remove zest from 1 lime in strips with a vegetable peeler and cut any white pith from strips with a sharp knife. Squeeze 3 tablespoons juice from limes. Bring zest, water, and sugar to a boil in a 1-quart saucepan, stirring until sugar is dissolved, then boil, uncovered, about 3 minutes. Remove from heat and stir in lime juice. Let syrup stand 20 minutes, then remove zest with a slotted spoon and discard.", "Toss together mangoes, blueberries, and syrup in a large bowl and sprinkle with ginger."], ["Preheat oven to 250°F. Lightly spray rimmed baking sheet with nonstick spray. Toss oats and next 3 ingredients in large bowl. Whisk syrup, brown sugar, oil, 2 tablespoons warm water and salt in small bowl to blend. Pour syrup mixture over oat mixture and stir to combine. Transfer to prepared baking sheet. Bake until evenly browned, stirring occasionally, about 1 hour 15 minutes. Cool. Transfer to large bowl. Mix in raisins. (Can be made 1 week ahead. Store in airtight container.)"], ["Bring apricots, wine, water, sugar, zest, and a pinch of salt to a boil in a small heavy saucepan over medium-high heat, stirring until sugar has dissolved. Reduce heat and simmer, partially covered, stirring occasionally, until liquid is reduced and very syrupy and apricots are very soft, about 15 minutes if using California (about 45 minutes if using Turkish). (If apricots are not yet softened, pour in an additional 1/4 cup water and continue cooking.)", "Remove from heat. Discard zest, then stir in rum. Transfer apricot mixture to a bowl and cool slightly, stirring occasionally, about 45 minutes.", "Purée in a food processor until mixture is very smooth. Add water to purée if necessary to achieve a spreadable consistency.", "Serve at room temperature or chilled."], ["Cook spaghetti in large pot of boiling salted water until just tender but still firm to bite. Drain; rinse with cold water and drain well. Place spaghetti in large bowl; add 1 teaspoon sesame oil and toss to blend. Add carrot, bell pepper, jicama and spinach to bowl.", "Whisk next 4 ingredients and remaining 3 teaspoons sesame oil in small bowl to blend. Season dressing with salt and pepper. Add dressing to salad and toss to combine.", "Divide salad among bowls and serve."], ["Whisk first 3 ingredients in small bowl to blend. Gradually whisk in both oils. Season dressing to taste with sea salt and pepper.", "Arrange lettuce on platter. Top with avocado and grapefruit, then dressing.", "Milder than vinegar, verjus is a tart juice made from unripe grapes; available at specialty foods stores and from chefshop.com and terrasonoma.com."], ["Toss 2 cups cooked barley (from about 2/3 cup dried), 1 thinly sliced fennel bulb, 2 thinly sliced small golden beets, 1/2 thinly sliced small red onion, 1/4 cup chopped toasted almonds, and 1/4 cup torn fresh mint in a large bowl with 1/4 cup olive oil and 3 tablespoons Sherry vinegar or red wine vinegar; season with salt and pepper."], ["Pulse first 4 ingredients in a blender until combined; season with salt and pepper. With blender running, slowly drizzle in oil. Process dressing until well blended.", "Place remaining ingredients in a large bowl; drizzle with 3 tablespoons dressing and toss to coat. Pass remaining dressing alongside for drizzling over."], ["Whisk together vinegar, shallot, salt, and pepper in a small bowl, then add oils in a slow stream, whisking until emulsified. Toss lettuce and celery leaves with just enough vinaigrette to coat in a large bowl."], ["Preheat oven to 425°F. Place barley in a medium pot and add water to cover by 1 1/2\". Season with salt. Bring to a boil; reduce heat and simmer uncovered until barley is tender and water is absorbed, 40-45 minutes. Spread out barley on a large rimmed baking sheet; let cool.", "While barley is cooking, toss fennel slices and 2 tablespoons oil in a medium bowl to coat. Season with salt and pepper. Spread fennel slices out in a single layer on another rimmed baking sheet. Roast until fennel is crisp-tender and beginning to brown in spots, about 18 minutes. Let fennel cool on baking sheet. DO AHEAD: Barley and fennel can be prepared 1 day ahead. Cover separately and refrigerate.", "Whisk orange juice, lime juice, shallot, 2 tablespoons dill, and zest in a medium bowl. Gradually whisk in remaining 1/2 cup oil; season orange vinaigrette with salt and pepper.", "Transfer barley to a large bowl; add roasted fennel, along with any accumulated juices on baking sheet. Add half of radishes, olives, and 1/4 cup dill sprigs. Drizzle 1/2 cup orange vinaigrette over and toss to coat; season with salt and pepper. Arrange salad on a large platter.", "Scatter remaining radishes, reserved fennel fronds, and remaining 1/4 cup dill sprigs over salad. Pass remaining orange vinaigrette alongside for drizzling over."], ["Bring 2 1/4 cups water to boil in heavy medium saucepan. Mix in rice and salt. Cover, reduce heat to low and simmer until rice is tender and water is absorbed, about 40 minutes. Transfer rice to large bowl; fluff with fork and cool.", "Whisk vinegar and sugar in small bowl. Gradually whisk in oil. Pour over rice. Add tomatoes and basil and toss to combine. Season with salt and pepper. (Can be made 6 hours ahead. Cover; chill. Bring to room temperature before serving.)"], ["Bring sugar, ginger, and 1/3 cup water to a boil in a small saucepan, stirring until sugar dissolves. Remove from heat; let steep for 10 minutes. Strain through a fine-mesh sieve into a medium pitcher (you should have 1/2 cup); discard ginger. Cover and chill syrup. DO AHEAD: Can be made 1 week ahead. Keep chilled.", "Fill four 6-ounce glasses with ice cubes. Add carrot juice and lime juice to ginger syrup in pitcher; stir well. Divide elixir among prepared glasses."], ["Purée chiles, garlic, lemongrass, oil, ginger, cumin, sugar, and 1 tsp. salt in a blender or food processor until smooth. Score cut sides of eggplant in a cross-hatch pattern with the tip of a sharp knife. Coat each eggplant liberally with curry paste; set aside any remaining paste. Let eggplants sit at least 10 minutes and up to 1 hour.", "Prepare a grill for medium-high heat. Lightly season eggplants with salt and grill, turning occasionally, until browned and tender, about 5 minutes per side. Serve with reserved curry paste.", "Marinade can be made 3 days ahead. Cover and chill."], ["Preheat oven to 400°F. Wrap beets in foil. Roast until beets are tender when pierced with fork, about 1 hour. Cool beets to room temperature. (Can be prepared 1 day ahead. Refrigerate beets in foil packets.) Peel beets. Cut beets into 3/4-inch pieces. Set aside. Cut peel and white pith from grapefruits. Working over bowl, cut between membranes to release segments. Drain segments, reserving 2 tablespoons juice. Cut segments into 3/4-inch pieces.", "Whisk vinegar, mustard and 2 tablespoons reserved grapefruit juice in small bowl to blend. Gradually whisk in oil. Season to taste with salt and pepper.", "Toss greens and 3/4 cup dressing in large bowl. Season to taste with salt and pepper. Divide salad among 10 plates. Scatter beets, grapefruit, avocados and pomegranate seeds over salads, dividing equally. Drizzle with remaining dressing."], ["Cook rice in a large pot of boiling salted water (1 tablespoon salt for 4 quarts water), uncovered, stirring occasionally, until tender, about 30 minutes. Drain in a sieve and rinse with cold water.", "Meanwhile, purée 1 cup basil leaves with oil, lemon juice, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a blender until emulsified. Tear remaining 1/2 cup basil leaves into a large bowl and stir together with dressing, rice, and remaining ingredients. Season to taste."], ["Preheat oven to 425°F with rack in middle.", "Toss squash and bell peppers with garlic, thyme, red pepper flakes, oil, and 1/2 teaspoon each of salt and pepper in a 17- by 11-inch 4-sided sheet pan. Roast, stirring once, until vegetables are just tender and browned in spots, 25 to 35 minutes.", "While vegetables finish roasting, cook linguine in a pasta pot of well-salted boiling water until al dente. Reserve 1/2 cup cooking water, then drain pasta and return to pot.", "Remove sheet pan from oven and pour reserved water over vegetables, stirring to loosen from pan. Stir in olives, then add vegetable mixture to pasta in pot and toss to combine."], ["Cut tops off onions. Cut tops lengthwise into thin strips; cut strips into 2-inch pieces. Chop half of onion bottoms. Place remaining bottoms in blender; add vinegar and ginger. Puree, occasionally scraping down sides of blender jar. Strain puree into measuring cup, pressing enough solids through to yield 1/2 cup dressing; season with pepper.", "Place carrots and cranberries in large bowl. Add onion tops and bottoms. Toss with enough dressing to coat."], ["In a bowl, combine the black rice, oranges, orange juice, pumpkin seeds, orange zest, salt, and chipotle. Gently mix in the avocado. Add more salt, if needed.", "Place a lettuce cup on each plate and spoon the salad into the lettuce cups. Garnish with orange wedges, if you wish.", "A very high-quality Chinese black rice is distributed by Lotus Foods under the registered trademark name \"Forbidden Black Rice.\" This rice bleeds beet­red when you rinse it and, once cooked, ends up a striking deep burgundy. It holds its shape very well and is pleasantly chewy. With a subtle sweetness and a rich taste, it's a stunning rice that has everything going for it. Put it high on your list of rices to try.", "Rinse the rice. Combine the rice, water, and salt (if using) in a heavy Dutch oven or saucepan. Over high heat, bring to a boil. Skim off any foam floating on the surface. Cover, reduce the heat, and simmer until the rice is tender, 30 to 35 minutes. Quickly drain off any excess water. Return the rice to the hot pot, cover, and let sit for 5 minutes."], ["Mix all the ingredients together in a small bowl. Set aside", "Put the tomato paste and 7 quarts (6.6 kilograms) cold water in a large nonreactive stockpot over high heat. Whisk occasionally as the water comes to a boil, then reduce the heat to maintain a gentle boil and cook for about 1 hour, or until it has reduced by about one-quarter. (Remove from the heat if the onions aren't ready.)", "Meanwhile, rinse the cilantro and parsley well and set aside. Cut the onions into large chunks. Put the chunks in a food processor and pulse until they are becoming a mush. Add as much of the herbs as fit into the food processor. Pulse the machine, adding small amounts of cold water if necessary to allow the blade to spin. As the herbs decrease in volume, add the remaining herbs and the celery leaves and continue to pulse. Stop from time to time to scrape the sides with a rubber spatula and mix the herbs to redistribute them. Run the machine for up to 10 minutes, until the mixture is almost liquefied.", "Transfer the mixture to a large saucepan and stir in the spice mix.", "Add the remaining 5 cups (1.2 kilograms) cold water to the onions and bring to a gentle boil over high heat, then reduce the heat and boil gently for about 1 hour or until the liquid is reduced by half.", "Stir the onion mixture into the stockpot, return to a simmer, and cook for 1 1/2 to 2 hours, skimming any impurities that rise to the top, until the soup has reduced by about one-third to just over 4 quarts (4 kilograms).", "Cut a lengthwise slit down one side of each date, open it as you would a book, and remove the pit. Cut the dates lengthwise in half, then cut each half lengthwise into 4 strips. Using your fingertips, shape each strip into a rough ball. If you keep the skin side facing out, the ball will be less sticky and will hold together better.", "Pour a shallow pool of olive oil into a small bowl. Rub a little of the oil on the center of one palm, put a date ball on it, and use the index finger of your other hand to roll the date into a smooth ball. Put the ball in the bowl of oil, and repeat with the rest of the dates, adding more oil to the bowl as needed to keep the date balls covered. Set aside.", "Put the lentils in a saucepan, add 6 cups (1.4 kilograms) cold water, and bring to a simmer over medium heat. Cook the lentils for 10 to 12 minutes, stirring them from time to time.", "Meanwhile, fill a large bowl with cold water. Taste a lentil. When they have started to soften but are still firm in the center, drain them in a fine-mesh strainer, rinse them with cold water, and submerge them in the bowl of cold water until ready to use.", "Remove the tough outer celery stalks and reserve them for another use. Pinch off the leaves from the inner stalks and place the leaves in a bowl of ice water. Cut the stalks into 1/8-inch dice; you need 1 cup (120 grams). Put the diced celery in a small bowl, toss with the olive oil and parsley, and season to taste with salt and pepper.", "Once the soup has reduced, add the lentils; keep warm over low heat.", "Whisk together the flour, water, and yeast in a small bowl and let sit at room temperature until foamy and bubbling, about 10 minutes.", "Whisking constantly, add the flour mixture to the soup, then stir with a flat-bottomed wooden spoon, scraping the bottom of the pot, as you bring the soup to a simmer over medium heat. (High heat could cause the flour to stick to the bottom of the pot.) Simmer the soup gently, stirring often, for 10 minutes. Season to taste with salt, remove the soup from the heat, and stir in the lemon juice.", "Drain and dry the celery leaves. Using 2 soupspoons, form the celery salad into a quenelle or football shape and place toward the rim of each soup bowl. Stack about 8 date balls alongside each quenelle. (If you end up with extra date balls, keep them in the refrigerator and add them to salads.)", "Carefully ladle the soup around the garnishes so that a bit of the celery salad and the date balls remain visible. Drizzle some of the olive oil that remains in the bowl of celery salad over the soup and garnish with the celery leaves."]]