[["Trim root end of each onion and cut an X in it. Blanch in boiling water 1 minute, then drain in a colander. Cool slightly, then peel.", "Bring juice, sugar, vinegar, and spices to a boil in a 3-quart heavy saucepan, stirring until sugar has dissolved. Add onions and quinces and simmer, uncovered, stirring occasionally, until tender but not falling apart, about 30 minutes.", "Add cranberries and simmer until tender but not falling apart, 5 to 8 minutes. Discard cloves. Transfer fruit and onions to a bowl using a slotted spoon, then boil syrup, if necessary, until reduced to 1/2 cup. Pour syrup over compote and cool to room temperature."], ["Blend extra-virgin olive oil, chives, and lemon juice in blender or processor until smooth. Stir in grated lemon peel. Season to taste with salt and pepper. DO AHEAD Chive oil can be made 3 hours ahead. Cover and chill. Return to room temperature before using.", "Fill 2 large bowls with ice water and ice; set aside. Pour enough water into each of 2 large skillets to reach depth of 1 inch. Bring water to slow simmer over medium heat. Add 3 tablespoons vinegar to each skillet. Carefully crack each egg into individual ramekins. Gently slide 1 egg at a time into simmering water, working in batches of 3 eggs for each skillet. Cook until whites are just set, about 3 minutes. Using slotted spoon, very gently transfer eggs to bowls with ice water, being careful not to break eggs. DO AHEAD Can be made 1 day ahead. Cover and refrigerate eggs in bowls of ice water.", "Preheat broiler. Spread asparagus in single layer on rimmed baking sheet. Drizzle with 3 tablespoons olive oil; turn asparagus to coat. Sprinkle with salt and pepper. Broil asparagus 6 minutes. Turn asparagus over and continue to broil until crisp-tender and beginning to brown, about 6 minutes longer. Divide asparagus among 6 plates and drape prosciutto slices over.", "Pour enough water into each of 2 large skillets to reach depth of 1 inch; bring to simmer. Using slotted spoon, transfer eggs to skillets; cook 1 minute for soft yolks. Using slotted spoon, place 1 or 2 eggs atop each serving of asparagus and prosciutto. Drizzle chive oil over and around each serving. Pass remaining chive oil separately."], ["Preheat oven to 425°F. Line baking sheet with parchment paper. Whisk flour, 1/3 cup sugar, peel, baking powder, and salt in bowl to blend. Add 1/2 cup chilled butter. Using fingertips, rub in until mixture resembles coarse meal. Mix in cranberries.", "Whisk crème fraîche, tangerine juice, and egg in medium bowl to blend. Gradually add to flour mixture, using fork to toss until moist clumps form. Knead dough briefly on lightly floured surface until smooth. Pat dough into 8-inch round. Cut into 8 equal wedges. Transfer to prepared baking sheet, spacing apart. Brush with melted butter; sprinkle with raw sugar.", "Bake until golden brown, about 12 minutes. Serve warm or at room temperature. (Can be made up to 1 month ahead. Cool completely. Wrap in aluminum foil; freeze. Serve at room temperature.)", "Also called turbinado or demerara sugar; available at natural foods stores and most supermarkets."], ["Preheat oven to 375°F. Place 2 tablespoons butter in 8 x 8 x 2-inch glass baking dish. Place dish in oven until butter melts, about 3 minutes. Remove from oven. Arrange pears in dish.", "Combine water and prunes in heavy small saucepan; bring to boil. Reduce heat; simmer until prunes are plump and liquid is reduced to 1/4 cup, about 8 minutes. Arrange prunes over pears. Drizzle with prune liquid. Sprinkle with brown sugar and cinnamon. Dot with 1 tablespoon butter. Bake until pears are tender, occasionally turning and basting with juices, about 35 minutes. Serve warm."], ["In a blender blend all pancake ingredients except oi until just combined.", "Heat a griddle over moderate heat until hot enough to make a drop of water scatter over surface and brush with oil. Working in batches, drop scant 1/4-cup measures of batter onto griddle to form pancakes about 4 inches in diameter and cook until bubbles appear on surface and undersides are brown, about 2 minutes. Flip pancakes with a metal spatula and cook until undersides are golden brown and pancakes are cooked through, about 2 minutes.", "Serve pancakes with syrup."], ["Cook bacon in a large skillet over medium heat, turning halfway through, until browned and crisp, 8–10 minutes.", "Meanwhile, use cutter to punch out a circle in the center of each piece of bread (save for snacking, now or later).", "Transfer bacon to a cutting board; cut in half crosswise. Carefully pour half of bacon drippings into a small bowl. Place 2 slices of bread in skillet and cook over medium-high until bottom sides are golden brown, about 3 minutes.", "Crack an egg into each hole in bread (some of the white may pool on top of the bread). Season eggs with salt and pepper and cook until underside is set, about 2 minutes. Using a thin spatula (a fish spatula works best), carefully turn both pieces of bread to briefly cook second side (this helps set the whites, but the yolk should still be runny), about 1 minute. Add 1 Tbsp. butter to skillet and swirl skillet to distribute, encouraging some to get underneath. Carefully turn bread again. Top one slice with half of the cheese. Remove pan from heat and let sit about 1 minute to soften cheese. Top with half of bacon and some hot sauce. Close up sandwich and transfer to a plate. Repeat process with remaining bacon drippings, bread, eggs, butter, bacon, and cheese and more hot sauce to make another sandwich."], ["Combine smoked ham and 12 cups water in heavy large saucepan or Dutch oven. Bring to boil. Reduce heat and simmer until ham is very tender and cooking liquid is reduced to 8 cups, about 1 1/2 hours. Transfer ham to bowl, using slotted spoon. Cool slightly. Cut meat from bones; chop meat coarsely.", "Skim fat from cooking liquid. Bring liquid to boil. Add sage. Reduce heat to medium. Gradually whisk in cornmeal. Cook until mixture thickens, stirring constantly, about 5 minutes. Remove pan from heat. Season cornmeal mixture to taste with salt and pepper. Add chopped ham and stir vigorously until combined. Pour mixture into two 8 1/2 x 4 1/2-inch loaf pans. Refrigerate ponice until set. (Can be prepared 2 days ahead. Cover with plastic and refrigerate.)", "Turn out ponice and cut into 1/2-inch-thick slices. Melt 1 tablespoon butter in large skillet over medium-high heat. Working in batches, add ponice and cook until brown, adding more butter as necessary, about 5 minutes per side. Serve, passing maple syrup."], ["Combine first 6 ingredients in large bowl. Mix in pasta. Add dressing and dill and blend well. Season salad to taste with salt and pepper. (Salad can be prepared 2 hours ahead. Cover and refrigerate.) Adjust salad with more dressing if desired and serve."], ["Preheat oven to 250°F. Line large rimmed baking sheet with foil.", "In large bowl, stir together olive oil, garlic, 1 teaspoon salt, and 1/2 teaspoon pepper. Dip tomato halves into oil, shake off excess, and arrange on baking sheet, cut sides down. Roast until skins are wrinkled and beginning to brown, about 2 hours. (Tomatoes can be roasted ahead and refrigerated, covered, up to 2 days. Bring to room temperature before using.)", "In large bowl, whisk together remaining 1/2 cup olive oil, vinegar, remaining 1/4 teaspoon salt, and remaining 1/4 teaspoon pepper. Add arugula and tomatoes and toss to coat."], ["Whisk first 8 ingredients in bowl to blend. Season dressing with salt and pepper. (Can be made 1 day ahead; chill. Bring to room temperature before using.)", "Combine clams, mussels, and wine in large wide pot. Cover tightly; cook over high heat until clams and mussels open, about 8 minutes (discard any clams and mussels that do not open). Using slotted spoon, transfer clams and mussels to very large bowl. Strain cooking liquid into medium bowl. Whisk 1/3 cup cooking liquid into dressing (reserve remaining cooking liquid for another use).", "Cook scallops in large saucepan of boiling salted water until just opaque in center, about 3 minutes. Using slotted spoon, add scallops to clams and mussels. Return water in saucepan to boil. Add shrimp and cook just until opaque in center, about 3 minutes. Drain. Transfer to bowl with shellfish. (Can be prepared 4 hours ahead and refrigerated.) Pour dressing over shellfish and toss to blend.", "Arrange slaw on very large platter. Mound salad in center and serve."], ["Combine spring onion and vinegar in a small bowl; let sit 20 minutes. Drain.", "Toss spring onion, cucumbers, garlic, all tomatoes, 1/4 cup lime juice, and 2 tablespoons oil in a large bowl; season with salt and pepper and toss gently with hands to coat. Transfer salad to a platter, reserving bowl.", "Add herbs and remaining 1/4 cup lime juice and 2 tablespoons oil to reserved bowl; season with salt and pepper and toss to coat. Mound herb mixture over salad."], ["Cook spaghetti in large pot of boiling salted water until just tender but still firm to bite. Drain; rinse with cold water and drain well. Place spaghetti in large bowl; add 1 teaspoon sesame oil and toss to blend. Add carrot, bell pepper, jicama and spinach to bowl.", "Whisk next 4 ingredients and remaining 3 teaspoons sesame oil in small bowl to blend. Season dressing with salt and pepper. Add dressing to salad and toss to combine.", "Divide salad among bowls and serve."], ["Heat large skillet over medium heat. Add 1 tortilla to skillet and heat until soft, about 1 minute per side; transfer to work surface. Repeat with second tortilla. Alternatively, open lavash on work surface. Spread half of coleslaw mixture on each tortilla or all of coleslaw on lavash, leaving 1/2-inch border at edges. Arrange beef, roasted peppers and green onions over coleslaw mixture. Starting at edge of tortillas or at 1 long side of lavash, roll up, enclosing fillings. Cut tortillas in half or lavash into 4 pieces."], ["Melt 2 tablespoons butter in heavy large pot over medium-high heat. Add onion and sauté until deep golden, about 7 minutes. Add next 7 in-gredients and stir 1 minute. Add broth and 1 cup water; bring to boil. Reduce heat, cover and simmer until vegetables are almost tender, about 10 minutes. Stir in cream, shiitake mushrooms, peas and chives. Season to taste with salt. Bring mixture to simmer. Mix remaining 1 tablespoon butter and flour in small bowl to blend. Stir into vegetable mixture; simmer until mixture thickens slightly, about 5 minutes. Divide vegetable mixture among six 2-cup soufflé or baking dishes; set aside. (Can be prepared 1 1/2 hours ahead. Let stand at room temperature.)", "Preheat oven to 425°F. Sift flour, baking powder and salt into bowl. Stir in chives. Add butter; rub in with fingertips until mixture re-sembles coarse meal. Add eggs and milk and stir until soft moist dough forms.", "Turn dough out onto generously floured surface. Knead gently just to combine. Divide dough into 6 equal pieces; pat out each piece to 31/2-inch round. Place 1 dough round atop vegetable filling in each dish (some filling will show around edges). Place dishes on large baking sheet. Bake until topping is golden and vegetable mixture is heated through, about 18 minutes. Let stand 5 minutes. Serve hot."], ["Arrange chicken in single layer in glass casserole or pie plate. Season with salt and pepper. Whisk oil, lime juice, tarragon and oregano in small bowl to blend. Pour marinade over chicken and turn to coat. Let stand at room temperature 20 minutes.", "Preheat broiler or prepare barbecue (medium-high heat). Transfer chicken to broiler pan or barbecue. Season with salt and pepper. Broil until just cooked through, about 3 minutes per side."], ["Heat 2 Tbsp. oil in a large skillet over medium-high. Cook sausage, breaking up with a wooden spoon, until cooked through, browned, and crisp in places, 5–8 minutes. Transfer to a small bowl with a slotted spoon. Reduce heat to medium; add onion and olives to skillet. Cook, stirring often, until onion is translucent, about 5 minutes. Add tomatoes, increase heat to medium-high, and cook, mashing tomatoes lightly and stirring often, until juices are slightly thickened, about 3 minutes.", "Meanwhile, cook pasta in a large pot of lightly salted boiling water, stirring occasionally, until very al dente, about 6 minutes. Drain, reserving 1 cup pasta cooking liquid.", "Add pasta and 3/4 cup pasta cooking liquid to sauce and cook, tossing, until pasta is al dente and sauce coats noodles. Mix in peperoncini, cooked sausage, and another 1/4 cup pasta cooking liquid. Then, tossing constantly, gradually add all but 1/2 cup cheese, followed by butter. Once incorporated, remove from heat and mix in basil. Divide pasta among bowls. Drizzle with oil; top with remaining cheese."], ["Combine chicken, 1/4 cup lemon juice and 1/2 teaspoon salt in medium bowl; let stand 30 minutes.", "Mix 1/4 cup plain yogurt, minced garlic, 1 1/2 tablespoons coriander, 2 teaspoons cumin, 1 teaspoon turmeric, 1/8 teaspoon ginger and crushed red pepper in small bowl. Add to chicken and stir until chicken is well coated with spice mixture. Refrigerate chicken at least 3 hours or overnight.", "Prepare barbecue (medium-high heat). Thread chicken on skewers, dividing equally. Brush chicken with melted butter. Season with salt. Grill kebabs until just cooked through, turning frequently, about 7 minutes."], ["Place pork in a large resealable plastic bag. Whisk lager, soy sauce, brown sugar, and 1 tablespoon vinegar in a small bowl; pour into bag with pork and seal. Chill, turning occasionally, for at least 4 and up to 24 hours.", "Preheat oven to 400°F. Heat oil in a large ovenproof skillet over medium-high heat. Remove pork from marinade, allowing any excess to drip off (reserve marinade). Cook pork, turning, until browned on all sides, 8-10 minutes.", "Transfer skillet to oven and roast until an instant-read thermometer inserted into thickest part of pork registers 140°F, 10-15 minutes. Transfer to a plate and let rest for at least 10 minutes. Pour reserved marinade into a small saucepan. Bring to a boil, reduce heat, and simmer until slightly thickened, 5-8 minutes.", "Meanwhile, melt butter in another large skillet over medium heat. Add cabbage, apple, bay leaves, and 1 cup water; season with salt and pepper. Cook, tossing occasionally, until cabbage is softened, 15-20 minutes. Add remaining 1 teaspoon vinegar and toss to combine.", "Slice pork and serve with cabbage mixture and sauce."], ["Cook shallots in butter in a 12-inch heavy skillet over moderate heat, stirring, until shallots are softened, about 5 minutes. Stir in garlic, bell pepper, and celery and cook, stirring occasionally, until pepper and celery are just tender, about 4 minutes.", "Add mussels and cook over moderately high heat, covered, until they just open, 4 to 6 minutes, checking periodically after 4 minutes and transferring mussels as opened to a bowl. (Discard any unopened mussels after 6 minutes.)", "While sauce is cooking, cook linguine in a 6-quart pot of boiling salted water until al dente. Reserve 3/4 cup cooking water and drain linguine in a colander.", "Add linguine to skillet along with cream, salt, pepper, and 1/3 cup pasta cooking water and bring to a simmer. Add mussels and toss carefully, adding more cooking water if pasta seems dry. Serve immediately, sprinkled with parsley."], ["Using small sharp knife, score duck skin in 1-inch-wide grid pattern. Season duck generously with salt and pepper. Heat oil in large skillet over medium-high heat. Add duck; cook about 6 minutes per side for medium. Transfer to cutting board; tent with foil. Discard all but 1/4 cup drippings from skillet. Heat drippings in skillet over high heat. Add pears, onions, and potatoes; sauté until beginning to brown, 5 minutes. Stir in sage; season with salt and pepper. Transfer hash to bowl; cover to keep warm.", "Heat same skillet over high heat. Add broth and vinegar; bring to boil, scraping up browned bits. Boil until reduced to glaze, about 5 minutes. Season glaze with salt and pepper.", "Divide hash among plates. Cut duck into 1/2-inch-thick slices; fan over hash. Drizzle glaze over and serve."], ["1. Rinse the fish in cold water and pat dry with paper towels. Season the fish inside and out with salt and pepper. Place the fish on a heatproof plate that is both large enough to accommodate it (a glass pie plate works well) and will also fit inside your steamer, bending the fish slightly if it is too long. Stuff half of the ginger inside the cavity of the fish and spread the remaining ginger on top of the fish.", "2. Pour water into a wok or stockpot and set a steamer in the wok or on the rim of the stockpot. Make sure the water does not touch the bottom of the steamer. Bring the water to a boil over high heat.", "3. Place the plate holding the fish in the steamer, cover, and steam for about 8 minutes, until the fish flakes easily when tested with the tip of a knife.", "4. While the fish is steaming, in a small bowl, stir together the soy sauce, wine, and 1 tablespoon of water. Set aside.", "5. When the fish is ready, carefully remove the plate from the steamer and pour off any accumulated liquid. Lay the scallion and cilantro along the top of the fish. In a small sauté pan, heat the oil over high heat until it is hot but not smoking. Remove the oil from the heat and pour it directly over the scallion and cilantro to \"cook\" them. Drizzle the soy mixture over the fish and serve immediately."]]